CSI API ETABS v1
cPropLink.SetDamperFrictionSpring Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDamperFrictionSpring(
	string Name,
	ref bool[] dof,
	ref bool[] Fixed,
	ref bool[] Nonlinear,
	ref double[] ke,
	ref double[] ce,
	ref double[] k,
	ref double[] K1,
	ref double[] K2,
	ref double[] u0,
	ref double[] us,
	ref int[] direction,
	double dj2,
	double dj3,
	string notes = "",
	string GUID = ""
)
Function SetDamperFrictionSpring (
	Name As String,
	ByRef dof As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Nonlinear As Boolean(),
	ByRef ke As Double(),
	ByRef ce As Double(),
	ByRef k As Double(),
	ByRef K1 As Double(),
	ByRef K2 As Double(),
	ByRef u0 As Double(),
	ByRef us As Double(),
	ByRef direction As Integer(),
	dj2 As Double,
	dj3 As Double,
	Optional notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim dof As Boolean()
Dim Fixed As Boolean()
Dim Nonlinear As Boolean()
Dim ke As Double()
Dim ce As Double()
Dim k As Double()
Dim K1 As Double()
Dim K2 As Double()
Dim u0 As Double()
Dim us As Double()
Dim direction As Integer()
Dim dj2 As Double
Dim dj3 As Double
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetDamperFrictionSpring(Name,
	dof, Fixed, Nonlinear, ke, ce, k, K1,
	K2, u0, us, direction, dj2, dj3, notes,
	GUID)
int SetDamperFrictionSpring(
	String^ Name,
	array<bool>^% dof,
	array<bool>^% Fixed,
	array<bool>^% Nonlinear,
	array<double>^% ke,
	array<double>^% ce,
	array<double>^% k,
	array<double>^% K1,
	array<double>^% K2,
	array<double>^% u0,
	array<double>^% us,
	array<int>^% direction,
	double dj2,
	double dj3,
	String^ notes = L"",
	String^ GUID = L""
)
abstract SetDamperFrictionSpring :
        Name : string *
        dof : bool[] byref *
        Fixed : bool[] byref *
        Nonlinear : bool[] byref *
        ke : float[] byref *
        ce : float[] byref *
        k : float[] byref *
        K1 : float[] byref *
        K2 : float[] byref *
        u0 : float[] byref *
        us : float[] byref *
        direction : int[] byref *
        dj2 : float *
        dj3 : float *
        ?notes : string *
        ?GUID : string
(* Defaults:
        let _notes = defaultArg notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
dof
Type: System.Boolean[]
Fixed
Type: System.Boolean[]
Nonlinear
Type: System.Boolean[]
ke
Type: System.Double[]
ce
Type: System.Double[]
k
Type: System.Double[]
K1
Type: System.Double[]
K2
Type: System.Double[]
u0
Type: System.Double[]
us
Type: System.Double[]
direction
Type: System.Int32[]
dj2
Type: System.Double
dj3
Type: System.Double
notes (Optional)
Type: System.String
GUID (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropLink Interface
ETABSv1 Namespace